Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME54_DFP/3.7.122/armcc/armcc/startup_same54p19a.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NonMaskableInt_Handler    PROC
                          EXPORT NonMaskableInt_Handler    [WEAK] 
                          B       .
                          ENDP
HardFault_Handler         PROC
                          EXPORT HardFault_Handler         [WEAK] 
                          B       .
                          ENDP
MemoryManagement_Handler  PROC
                          EXPORT MemoryManagement_Handler  [WEAK] 
                          B       .
                          ENDP
BusFault_Handler          PROC
                          EXPORT BusFault_Handler          [WEAK] 
                          B       .
                          ENDP
UsageFault_Handler        PROC
                          EXPORT UsageFault_Handler        [WEAK] 
                          B       .
                          ENDP
SVC_Handler               PROC
                          EXPORT SVC_Handler               [WEAK] 
                          B       .
                          ENDP
DebugMonitor_Handler      PROC
                          EXPORT DebugMonitor_Handler      [WEAK] 
                          B       .
                          ENDP
PendSV_Handler            PROC
                          EXPORT PendSV_Handler            [WEAK] 
                          B       .
                          ENDP
SysTick_Handler           PROC
                          EXPORT SysTick_Handler           [WEAK] 
                          B       .
                          ENDP

Default_Handler PROC
                EXPORT  PM_Handler                [WEAK]
                EXPORT  MCLK_Handler              [WEAK]
                EXPORT  OSCCTRL_XOSC0_Handler     [WEAK]
                EXPORT  OSCCTRL_XOSC1_Handler     [WEAK]
                EXPORT  OSCCTRL_DFLL_Handler      [WEAK]
                EXPORT  OSCCTRL_DPLL0_Handler     [WEAK]
                EXPORT  OSCCTRL_DPLL1_Handler     [WEAK]
                EXPORT  OSC32KCTRL_Handler        [WEAK]
                EXPORT  SUPC_OTHER_Handler        [WEAK]
                EXPORT  SUPC_BODDET_Handler       [WEAK]
                EXPORT  WDT_Handler               [WEAK]
                EXPORT  RTC_Handler               [WEAK]
                EXPORT  EIC_EXTINT_0_Handler      [WEAK]
                EXPORT  EIC_EXTINT_1_Handler      [WEAK]
                EXPORT  EIC_EXTINT_2_Handler      [WEAK]
                EXPORT  EIC_EXTINT_3_Handler      [WEAK]
                EXPORT  EIC_EXTINT_4_Handler      [WEAK]
                EXPORT  EIC_EXTINT_5_Handler      [WEAK]
                EXPORT  EIC_EXTINT_6_Handler      [WEAK]
                EXPORT  EIC_EXTINT_7_Handler      [WEAK]
                EXPORT  EIC_EXTINT_8_Handler      [WEAK]
                EXPORT  EIC_EXTINT_9_Handler      [WEAK]
                EXPORT  EIC_EXTINT_10_Handler     [WEAK]
                EXPORT  EIC_EXTINT_11_Handler     [WEAK]
                EXPORT  EIC_EXTINT_12_Handler     [WEAK]
                EXPORT  EIC_EXTINT_13_Handler     [WEAK]
                EXPORT  EIC_EXTINT_14_Handler     [WEAK]
                EXPORT  EIC_EXTINT_15_Handler     [WEAK]
                EXPORT  FREQM_Handler             [WEAK]
                EXPORT  NVMCTRL_0_Handler         [WEAK]
                EXPORT  NVMCTRL_1_Handler         [WEAK]
                EXPORT  DMAC_0_Handler            [WEAK]
                EXPORT  DMAC_1_Handler            [WEAK]
                EXPORT  DMAC_2_Handler            [WEAK]
                EXPORT  DMAC_3_Handler            [WEAK]
                EXPORT  DMAC_OTHER_Handler        [WEAK]
                EXPORT  EVSYS_0_Handler           [WEAK]
                EXPORT  EVSYS_1_Handler           [WEAK]
                EXPORT  EVSYS_2_Handler           [WEAK]
                EXPORT  EVSYS_3_Handler           [WEAK]
                EXPORT  EVSYS_OTHER_Handler       [WEAK]
                EXPORT  PAC_Handler               [WEAK]
                EXPORT  RAMECC_Handler            [WEAK]
                EXPORT  SERCOM0_0_Handler         [WEAK]
                EXPORT  SERCOM0_1_Handler         [WEAK]
                EXPORT  SERCOM0_2_Handler         [WEAK]
                EXPORT  SERCOM0_OTHER_Handler     [WEAK]
                EXPORT  SERCOM1_0_Handler         [WEAK]
                EXPORT  SERCOM1_1_Handler         [WEAK]
                EXPORT  SERCOM1_2_Handler         [WEAK]
                EXPORT  SERCOM1_OTHER_Handler     [WEAK]
                EXPORT  SERCOM2_0_Handler         [WEAK]
                EXPORT  SERCOM2_1_Handler         [WEAK]
                EXPORT  SERCOM2_2_Handler         [WEAK]
                EXPORT  SERCOM2_OTHER_Handler     [WEAK]
                EXPORT  SERCOM3_0_Handler         [WEAK]
                EXPORT  SERCOM3_1_Handler         [WEAK]
                EXPORT  SERCOM3_2_Handler         [WEAK]
                EXPORT  SERCOM3_OTHER_Handler     [WEAK]
                EXPORT  SERCOM4_0_Handler         [WEAK]
                EXPORT  SERCOM4_1_Handler         [WEAK]
                EXPORT  SERCOM4_2_Handler         [WEAK]
                EXPORT  SERCOM4_OTHER_Handler     [WEAK]
                EXPORT  SERCOM5_0_Handler         [WEAK]
                EXPORT  SERCOM5_1_Handler         [WEAK]
                EXPORT  SERCOM5_2_Handler         [WEAK]
                EXPORT  SERCOM5_OTHER_Handler     [WEAK]
                EXPORT  SERCOM6_0_Handler         [WEAK]
                EXPORT  SERCOM6_1_Handler         [WEAK]
                EXPORT  SERCOM6_2_Handler         [WEAK]
                EXPORT  SERCOM6_OTHER_Handler     [WEAK]
                EXPORT  SERCOM7_0_Handler         [WEAK]
                EXPORT  SERCOM7_1_Handler         [WEAK]
                EXPORT  SERCOM7_2_Handler         [WEAK]
                EXPORT  SERCOM7_OTHER_Handler     [WEAK]
                EXPORT  CAN0_Handler              [WEAK]
                EXPORT  CAN1_Handler              [WEAK]
                EXPORT  USB_OTHER_Handler         [WEAK]
                EXPORT  USB_SOF_HSOF_Handler      [WEAK]
                EXPORT  USB_TRCPT0_Handler        [WEAK]
                EXPORT  USB_TRCPT1_Handler        [WEAK]
                EXPORT  GMAC_Handler              [WEAK]
                EXPORT  TCC0_OTHER_Handler        [WEAK]
                EXPORT  TCC0_MC0_Handler          [WEAK]
                EXPORT  TCC0_MC1_Handler          [WEAK]
                EXPORT  TCC0_MC2_Handler          [WEAK]
                EXPORT  TCC0_MC3_Handler          [WEAK]
                EXPORT  TCC0_MC4_Handler          [WEAK]
                EXPORT  TCC0_MC5_Handler          [WEAK]
                EXPORT  TCC1_OTHER_Handler        [WEAK]
                EXPORT  TCC1_MC0_Handler          [WEAK]
                EXPORT  TCC1_MC1_Handler          [WEAK]
                EXPORT  TCC1_MC2_Handler          [WEAK]
                EXPORT  TCC1_MC3_Handler          [WEAK]
                EXPORT  TCC2_OTHER_Handler        [WEAK]
                EXPORT  TCC2_MC0_Handler          [WEAK]
                EXPORT  TCC2_MC1_Handler          [WEAK]
                EXPORT  TCC2_MC2_Handler          [WEAK]
                EXPORT  TCC3_OTHER_Handler        [WEAK]
                EXPORT  TCC3_MC0_Handler          [WEAK]
                EXPORT  TCC3_MC1_Handler          [WEAK]
                EXPORT  TCC4_OTHER_Handler        [WEAK]
                EXPORT  TCC4_MC0_Handler          [WEAK]
                EXPORT  TCC4_MC1_Handler          [WEAK]
                EXPORT  TC0_Handler               [WEAK]
                EXPORT  TC1_Handler               [WEAK]
                EXPORT  TC2_Handler               [WEAK]
                EXPORT  TC3_Handler               [WEAK]
                EXPORT  TC4_Handler               [WEAK]
                EXPORT  TC5_Handler               [WEAK]
                EXPORT  TC6_Handler               [WEAK]
                EXPORT  TC7_Handler               [WEAK]
                EXPORT  PDEC_OTHER_Handler        [WEAK]
                EXPORT  PDEC_MC0_Handler          [WEAK]
                EXPORT  PDEC_MC1_Handler          [WEAK]
                EXPORT  ADC0_OTHER_Handler        [WEAK]
                EXPORT  ADC0_RESRDY_Handler       [WEAK]
                EXPORT  ADC1_OTHER_Handler        [WEAK]
                EXPORT  ADC1_RESRDY_Handler       [WEAK]
                EXPORT  AC_Handler                [WEAK]
                EXPORT  DAC_OTHER_Handler         [WEAK]
                EXPORT  DAC_EMPTY_0_Handler       [WEAK]
                EXPORT  DAC_EMPTY_1_Handler       [WEAK]
                EXPORT  DAC_RESRDY_0_Handler      [WEAK]
                EXPORT  DAC_RESRDY_1_Handler      [WEAK]
                EXPORT  I2S_Handler               [WEAK]
                EXPORT  PCC_Handler               [WEAK]
                EXPORT  AES_Handler               [WEAK]
                EXPORT  TRNG_Handler              [WEAK]
                EXPORT  ICM_Handler               [WEAK]
                EXPORT  PUKCC_Handler             [WEAK]
                EXPORT  QSPI_Handler              [WEAK]
                EXPORT  SDHC0_Handler             [WEAK]
                EXPORT  SDHC1_Handler             [WEAK]


PM_Handler               
MCLK_Handler             
OSCCTRL_XOSC0_Handler    
OSCCTRL_XOSC1_Handler    
OSCCTRL_DFLL_Handler     
OSCCTRL_DPLL0_Handler    
OSCCTRL_DPLL1_Handler    
OSC32KCTRL_Handler       
SUPC_OTHER_Handler       
SUPC_BODDET_Handler      
WDT_Handler              
RTC_Handler              
EIC_EXTINT_0_Handler     
EIC_EXTINT_1_Handler     
EIC_EXTINT_2_Handler     
EIC_EXTINT_3_Handler     
EIC_EXTINT_4_Handler     
EIC_EXTINT_5_Handler     
EIC_EXTINT_6_Handler     
EIC_EXTINT_7_Handler     
EIC_EXTINT_8_Handler     
EIC_EXTINT_9_Handler     
EIC_EXTINT_10_Handler    
EIC_EXTINT_11_Handler    
EIC_EXTINT_12_Handler    
EIC_EXTINT_13_Handler    
EIC_EXTINT_14_Handler    
EIC_EXTINT_15_Handler    
FREQM_Handler            
NVMCTRL_0_Handler        
NVMCTRL_1_Handler        
DMAC_0_Handler           
DMAC_1_Handler           
DMAC_2_Handler           
DMAC_3_Handler           
DMAC_OTHER_Handler       
EVSYS_0_Handler          
EVSYS_1_Handler          
EVSYS_2_Handler          
EVSYS_3_Handler          
EVSYS_OTHER_Handler      
PAC_Handler              
RAMECC_Handler           
SERCOM0_0_Handler        
SERCOM0_1_Handler        
SERCOM0_2_Handler        
SERCOM0_OTHER_Handler    
SERCOM1_0_Handler        
SERCOM1_1_Handler        
SERCOM1_2_Handler        
SERCOM1_OTHER_Handler    
SERCOM2_0_Handler        
SERCOM2_1_Handler        
SERCOM2_2_Handler        
SERCOM2_OTHER_Handler    
SERCOM3_0_Handler        
SERCOM3_1_Handler        
SERCOM3_2_Handler        
SERCOM3_OTHER_Handler    
SERCOM4_0_Handler        
SERCOM4_1_Handler        
SERCOM4_2_Handler        
SERCOM4_OTHER_Handler    
SERCOM5_0_Handler        
SERCOM5_1_Handler        
SERCOM5_2_Handler        
SERCOM5_OTHER_Handler    
SERCOM6_0_Handler        
SERCOM6_1_Handler        
SERCOM6_2_Handler        
SERCOM6_OTHER_Handler    
SERCOM7_0_Handler        
SERCOM7_1_Handler        
SERCOM7_2_Handler        
SERCOM7_OTHER_Handler    
CAN0_Handler             
CAN1_Handler             
USB_OTHER_Handler        
USB_SOF_HSOF_Handler     
USB_TRCPT0_Handler       
USB_TRCPT1_Handler       
GMAC_Handler             
TCC0_OTHER_Handler       
TCC0_MC0_Handler         
TCC0_MC1_Handler         
TCC0_MC2_Handler         
TCC0_MC3_Handler         
TCC0_MC4_Handler         
TCC0_MC5_Handler         
TCC1_OTHER_Handler       
TCC1_MC0_Handler         
TCC1_MC1_Handler         
TCC1_MC2_Handler         
TCC1_MC3_Handler         
TCC2_OTHER_Handler       
TCC2_MC0_Handler         
TCC2_MC1_Handler         
TCC2_MC2_Handler         
TCC3_OTHER_Handler       
TCC3_MC0_Handler         
TCC3_MC1_Handler         
TCC4_OTHER_Handler       
TCC4_MC0_Handler         
TCC4_MC1_Handler         
TC0_Handler              
TC1_Handler              
TC2_Handler              
TC3_Handler              
TC4_Handler              
TC5_Handler              
TC6_Handler              
TC7_Handler              
PDEC_OTHER_Handler       
PDEC_MC0_Handler         
PDEC_MC1_Handler         
ADC0_OTHER_Handler       
ADC0_RESRDY_Handler      
ADC1_OTHER_Handler       
ADC1_RESRDY_Handler      
AC_Handler               
DAC_OTHER_Handler        
DAC_EMPTY_0_Handler      
DAC_EMPTY_1_Handler      
DAC_RESRDY_0_Handler     
DAC_RESRDY_1_Handler     
I2S_Handler              
PCC_Handler              
AES_Handler              
TRNG_Handler             
ICM_Handler              
PUKCC_Handler            
QSPI_Handler             
SDHC0_Handler            
SDHC1_Handler            
                B       .
                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END

